app/Models/setup/ModelSetupsalesman.php

SELECT `setupsalesman1`.*, `lokasi1`.`nama_lokasi`
FROM `setupsalesman1`
LEFT JOIN `lokasi1` ON `lokasi1`.`id_lokasi` = `setupsalesman1`.`id_lokasi`
---
    public function getSalesmanwithLokasi()
    {
        return $this->select('setupsalesman1.*, lokasi1.nama_lokasi')
            ->join('lokasi1', 'lokasi1.id_lokasi = setupsalesman1.id_lokasi', 'left')
            ->findAll();

SELECT `setupsalesman1`.*, `lokasi1`.`nama_lokasi`
FROM `setupsalesman1`
LEFT JOIN `lokasi1` ON `lokasi1`.`id_lokasi` = `setupsalesman1`.`id_lokasi`
WHERE `id_salesman` = '8'
 LIMIT 1
---
    public function getSalesmanById($id)
    {
        return $this->select('setupsalesman1.*, lokasi1.nama_lokasi')
            ->join('lokasi1', 'lokasi1.id_lokasi = setupsalesman1.id_lokasi', 'left')
            ->where('id_salesman', $id)
            ->first();