app/Models/setup/ModelHutangPiutang.php

    public function getHutangPiutang($id, $relasi_tipe)
    {
        return $this->where(['relasi_id' => $id, 'relasi_tipe' => $relasi_tipe])->findAll();
---
SELECT *
FROM `setup_hutang_piutang`
WHERE `relasi_id` = '6'
AND `relasi_tipe` = 'pelanggan'