app/Controllers/setup/SetupPelanggan.php

    public function createPiutang($id = null)
    {
        if ($this->request->isAJAX()) {
            $this->db->transBegin();

            try {
                $saldoPiutang = $this->request->getVar('saldo');

                $data = [
                    'tanggal' => $this->request->getVar('tanggal'),
                    'nota' => $this->request->getVar('nota'),
                    'tanggal_jt' => $this->request->getVar('tanggal_jt'),
                    'saldo' => $saldoPiutang,
                    'relasi_id' => $id,
                    'relasi_tipe' => 'pelanggan',
                    'jenis' => 'piutang'
                ];

                // Masukkan data ke dalam tabel
                if ($this->hutangPiutangModel->insert($data)) {
---
INSERT INTO `setup_hutang_piutang` (`tanggal`, `nota`, `tanggal_jt`, `saldo`, `relasi_id`, `relasi_tipe`, `jenis`) VALUES ('2025-04-09', 'inv-300031', '2025-04-26', '300000', '5', 'pelanggan', 'piutang')

    public function deletePiutang($id_hutang_piutang = null)
    {
        if ($this->request->isAJAX()) {
            $this->db->transBegin();

            try {
                // Ambil data piutang sebelum dihapus
                $piutang = $this->hutangPiutangModel->find($id_hutang_piutang);
                $jumlahPiutang = (float)$piutang->saldo;
                $pelangganId = $piutang->relasi_id;

                // Hapus data piutang
                if ($this->hutangPiutangModel->delete($id_hutang_piutang)) {
---
SELECT *
FROM `setup_hutang_piutang`
WHERE `setup_hutang_piutang`.`id_hutang_piutang` = '12'
DELETE FROM `setup_hutang_piutang`
WHERE `id_hutang_piutang` IN ('12')