app/Controllers/setup/SetupSalesman.php

INSERT INTO `setup_hutang_piutang` (`tanggal`, `nota`, `tanggal_jt`, `saldo`, `relasi_id`, `relasi_tipe`, `jenis`) VALUES ('2025-04-10', 'inv-200024', '2025-05-01', '1000000', '8', 'salesman', 'piutang')
---
    public function addPiutang($id = null)
    {
        if ($this->request->isAJAX()) {
            $this->db->transBegin();

            try {
                $saldoPiutang = $this->request->getVar('saldo');

                $data = [
                    'tanggal' => $this->request->getVar('tanggal'),
                    'nota' => $this->request->getVar('nota'),
                    'tanggal_jt' => $this->request->getVar('tanggal_jt'),
                    'saldo' => $saldoPiutang,
                    'relasi_id' => $id,
                    'relasi_tipe' => 'salesman',
                    'jenis' => 'piutang'
                ];

                // Masukkan data ke dalam tabel
                if ($this->hutangPiutangModel->insert($data)) {

SELECT *
FROM `setup_hutang_piutang`
WHERE `setup_hutang_piutang`.`id_hutang_piutang` = '6'
DELETE FROM `setup_hutang_piutang`
WHERE `id_hutang_piutang` IN ('6')
---
    public function deletePiutang($id_hutang_piutang = null)
    {
        if ($this->request->isAJAX()) {
            $this->db->transBegin();

            try {
                // Ambil data piutang sebelum dihapus
                $piutang = $this->hutangPiutangModel->find($id_hutang_piutang);
                $jumlahPiutang = (float)$piutang->saldo;
                $salesmanId = $piutang->relasi_id;

                // Hapus data piutang
                if ($this->hutangPiutangModel->delete($id_hutang_piutang)) {